/**************************************************************************

  =======================
  The Voyager Web Browser
  =======================

  Copyright (C) 1995-2003 by
   Oliver Wagner <owagner@vapor.com>
   All Rights Reserved

  Parts Copyright (C) by
   David Gerber <zapek@vapor.com>
   Jon Bright <jon@siliconcircus.com>
   Matt Sealey <neko@vapor.com>

**************************************************************************/


/*
**
** This class visually embeds a HTML document
** and manages network operations
**
** $Id: htmlview.c,v 1.263 2004/06/09 22:50:32 zapek Exp $
**
*/
#define WHEEL_MOUSE_IS_FUCKED 0

/* XXX: I disabled smooth mode temporarily */
#define USE_SMOOTH_SCROLLING 0

#ifdef MBX
#include <modules/mui/features.h> /* HACK... sigh */
#endif

#include "voyager.h"

/* public */
#if defined( AMIGAOS ) || defined( __MORPHOS__ )
#include <proto/exec.h>
#include <proto/graphics.h>
#include <graphics/gfxmacros.h>
#include <proto/layers.h>
#endif

#include "classes.h"
#include "prefs.h"
#include "network.h"
#include "voyager_cat.h"
#if USE_PLUGINS
#include "plugins.h"
#endif
#include "htmlclasses.h"
#include "layout.h"
#ifndef MBX
#include "bitmapclone.h"
#else
#include <modules/mui/features.h>
#include <modules/mui/mui.h>
#endif
#include "classes.h"
#include "htmlclasses.h"
#include "malloc.h"
#include "mui_func.h"
#include <proto/vimgdecode.h>
#include "methodstack.h"
#include "js.h"
#include "sourceview.h"
#include "docinfowin.h"
#include "download.h"
#include "cookies.h"
#include "clip.h"
#include "win_func.h"
#ifndef __MORPHOS__
#include "newmouse.h"
#endif
#include "urlparser.h"

/*
	The following is internal MUI data
	The horror, the horror
*/

#ifdef __MORPHOS__
#pragma pack(2)
#endif /* __MORPHOS__ */

#define H    0
#define V    1
#define DIMS 2

struct LongRect
{
	LONG left;
	LONG top;
	LONG right;
	LONG bottom;
};

struct VirtgroupData
{
	APTR clip;						/* 0x00 */
	Object *scrollgroup;					/* 0x04 */

	LONG pos[DIMS];						/* 0x08 */
	LONG size[DIMS];					/* 0x10 */
	LONG oldpos[DIMS];					/* 0x18 */
	BYTE free[DIMS];					/* 0x20 */
	UWORD  Pad1;						/* 0x22 */
	LONG mx;						/* 0x24 */
	LONG my;						/* 0x28 */

	BOOL clipdraw;						/* 0x2c */
	BOOL input;						/* 0x2e */

	struct MUI_EventHandlerNode eh;				/* 0x30 */
	LONG imode;						/* 0x48 */

	#if defined(USE_SAMPLEGAG) || defined(USE_ABOUTMUIGAG)
	int PageID;						/* 0x4c */
	int SubPageID;						/* 0x50 */
	#endif

	#ifdef USE_SPECIALMIDMOVE
	struct MUI_InputHandlerNode midmove;			/* 0x50 */
	int midmove_active;					/* 0x68 */
	struct BitMap *pointerbitmap;				/* 0x6c */
	Object *pointerobj;					/* 0x70 */
	int pointerid;						/* 0x74 */
	ULONG mb_lastsecs;					/* 0x78 */
	ULONG mb_lastmics;					/* 0x7c */
	#endif
};								/* 0x80 */

struct VirtgroupData38
{
	APTR clip;
	Object *scrollgroup;

	LONG pos[DIMS];
	LONG size[DIMS];
	LONG oldpos[DIMS];
	BYTE free[DIMS];

	LONG mx;
	LONG my;

	/*
	#ifdef USE_HTMLGAG
	ULONG gagtype;
	#define MUISpecialBase (data->muispecialbase)
	struct Library *muispecialbase;
	struct Gag *gag;
	struct MUI_EventHandlerNode ehn;
	LONG gagleft;
	LONG gagtop;
	#endif
	*/

	unsigned clipdraw:1,
	         moving1:1,
	         input:1,
	         reqticks:1,
	         moving2:1,
				#ifdef USE_VIRTGROUPID
				PageID:8,
				SubPageID:8,
				#endif
				dummy:1;

	#ifdef USE_SPECIALMIDMOVE
	struct MUI_InputHandlerNode midmove;
	#endif
};

struct GroupData
{
	struct MinList ChildList; // muß an erster Stelle sein!	/* 0x00 */
	ULONG gidcmp;						/* 0x0c */
	struct BresenhamInfo *binfo[DIMS];			/* 0x10 */
	WORD dim[DIMS];						/* 0x18 */
	BYTE sspace[DIMS];					/* 0x1c */
	BYTE space[DIMS];					/* 0x1e */
	BYTE samedim[DIMS];					/* 0x20 */
	BYTE activepage;					/* 0x22 */
	BYTE change_count;					/* 0x23 */

	struct Hook *LayoutHook;				/* 0x24 */


	unsigned long						/* 0x28 */
				gtype        :2,
				pagemode     :1,
				freemode     :1,
				regiondraw   :1,
				pagemax      :1,
				stopget      :1,
				virtual      :1,
				hvirt        :1,
				vvirt        :1,
				virtdraw     :1,
				nochange     :1,
				unevenchilds :1,		/* 13 Bits */

				pad : 19;			/* to force sas to make an ULONG instead of an UWORD..sick */
};								/* 0x2c */

#ifdef __MORPHOS__
#pragma pack()
#endif /* __MORPHOS__ */

#define overlap(l1,t1,r1,b1,l2,t2,r2,b2) ( (r1)>=(l2) && (r2)>=(l1) && (b1)>=(t2) && (b2)>=(t1) )

LONG MUIG_ScrollRaster(struct RastPort *rp,WORD dx,WORD dy,WORD left,WORD top,WORD right,WORD bottom);
#if !defined( MBX ) && !defined( __MORPHOS__ )
extern struct Library *MUIGfxBase;
#pragma libcall MUIGfxBase MUIG_ScrollRaster f0 543210807
#endif

#ifdef __MORPHOS__
extern struct Library *MUIGfxBase;
#define MUIG_ScrollRaster(rp, dx, dy, left, top, right, bottom) \
